import matplotlib as plt

x = [10, 100, 1000, 10000] #1, 2, 5, 6

#1 НАБІР ОДНАКОВИХ ЕЛЕМЕНТІВ
y1_lt = [0, 0, 0.320010, 32.960059]
y1_lc = [45, 4950, 499500, 49995000]
y1_ls = [63, 5148, 501498, 50014998]
y1_lm = [144, 864, 8064, 80064]

y2_lt = [0, 0, 0.305246, 32.249923]
y2_lc = [45, 4950, 499500, 49995000]
y2_ls = [63, 5148, 501498, 50014998]
y2_lm = [144, 864, 8064, 80064]

y3_lt = [0, 0, 0.305079, 32.079781]
y3_lc = [45, 4950, 499500, 49995000]
y3_ls = [63, 5148, 501498, 50014998]
y3_lm = [144, 864, 8064, 80064]

y4_lt = [0, 0.005034, 0.319938, 32.389939]
y4_lc = [45, 4950, 499500, 49995000]
y4_ls = [63, 5148, 501498, 50014998]
y4_lm = [144, 864, 8064, 80064]

y5_ht = [0.010256, 0, 0, 0.05991]
y5_hc = [0, 0, 0, 0]
y5_hs = [24, 415, 5931, 74607]
y5_hm = [144, 864, 8064, 80064]

y6_ht = [0, 0, 0, 0.084783]
y6_hc = [0, 0, 0, 0]
y6_hs = [24, 415, 5931, 74607]
y6_hm = [144, 864, 8064, 80064]

y7_ht = [0, 0, 0.015641, 0.066993]
y7_hc = [0, 0, 0, 0]
y7_hs = [24, 415, 5931, 74607]
y7_hm = [144, 864, 8064, 80064]

y8_ht = [0, 0.015622, 0.01562, 0.154917]
y8_hc = [0, 0, 0, 0]
y8_hs = [24, 415, 5931, 74607]
y8_hm = [144, 864, 8064, 80064]

y9_wt = [0, 0, 0, 0.005031]
y9_wc = [9, 99, 999, 9999]
y9_ws = [1, 1, 1, 1]
y9_wm = [144, 864, 8064, 80064]

y10_pt = [0, 0, 0, 0]
y10_pc = [8, 98, 998, 9998]
y10_ps = [2, 2, 2, 2]
y10_pm = [144, 864, 8064, 80064]



#2 ВІДСОРТОВАНІ ДАНІ
y1_lt = [0, 0.010045, 0.300096, 32.714784]
y1_lc = [45, 4950, 499500, 49995000]
y1_ls = [63, 5148, 501498, 50014998]
y1_lm = [200, 1008, 9112, 90112]

y2_lt = [0, 0.010218, 0.01007, 0.110264]
y2_lc = [28, 654, 11862, 154624]
y2_ls = [29, 377, 7832, 88570]
y2_lm = [200, 1008, 9112, 90112]

y3_lt = [0, 0.005014, 0.060292, 6.160079]
y3_lc = [25, 2500, 250000, 25000000]
y3_ls = [14, 149, 1499, 14999]
y3_lm = [200, 1008, 9112, 90112]

y4_lt = [0, 0, 0.019934, 0.140414]
y4_lc = [19, 627, 9560, 129542]
y4_ls = [22, 396, 5380, 76924]
y4_lm = [200, 1008, 9112, 90112]

y5_ht = [0, 0, 0.015620, 0.050193]
y5_hc = [25, 573, 8977, 123617]
y5_hs = [9, 99, 999, 9999]
y5_hm = [200, 1008, 9112, 90112]

y6_ht = [0, 0, 0.015599, 0.080491]
y6_hc = [18, 513, 8528, 117536]
y6_hs = [15, 157, 1556, 15898]
y6_hm = [200, 1008, 9112, 90112]

y7_ht = [0, 0, 0, 0.073997]
y7_hc = [13, 447, 7955, 110003]
y7_hs = [18, 198, 1998, 19998]
y7_hm = [200, 1008, 9112, 90112]

y8_ht = [0, 0, 0.015621, 0.170021]
y8_hc = [19, 521, 8785, 120335]
y8_hs = [15, 147, 1484, 15080]
y8_hm = [200, 1008, 9112, 90112]

y9_wt = [0, 0, 0.019889, 0.185006]
y9_wc = [19, 545, 9570, 136122]
y9_ws = [24, 600, 10143, 141836]
y9_wm = [200, 1008, 9112, 90112]

y10_pt = [0, 0, 0.005037, 0.01023]
y10_pc = [8, 98, 998, 9998]
y10_ps = [2, 2, 2, 2]
y10_pm = [200, 1008, 9112, 90112]



#5 В ЗВОРОТНОМУ ПОРЯДКУ
y1_lt = [0, 0, 0.219907, 22.559994]
y1_lc = [45, 4950, 499500, 49995000]
y1_ls = [38, 2648, 251498, 25014998]
y1_lm = [200, 1008, 9112, 90112]

y2_lt = [0, 0, 0.005095, 0.114747]
y2_lc = [21, 631, 10696, 165434]
y2_ls = [26, 498, 6509, 93131]
y2_lm = [200, 1008, 9112, 90112]

y3_lt = [0, 0, 0.134715, 14.18958]
y3_lc = [27, 2524, 250248, 25002498]
y3_ls = [31, 2034, 189120, 18766245]
y3_lm = [200, 1008, 9112, 90112]

y4_lt = [0, 0, 0.009987, 0.141079]
y4_lc = [21, 524, 9159, 137406]
y4_ls = [27, 374, 5719, 74380]
y4_lm = [200, 1008, 9112, 90112]

y5_ht = [0, 0, 0, 0.060029]
y5_hc = [16, 474, 7978, 113618]
y5_hs = [14, 149, 1499, 14999]
y5_hm = [200, 1008, 9112, 90112]

y6_ht = [0, 0, 0, 0.074969]
y6_hc = [10, 424, 7274, 107369]
y6_hs = [18, 212, 2263, 20940]
y6_hm = [200, 1008, 9112, 90112]

y7_ht = [0, 0, 0.015619, 0.064978]
y7_hc = [10, 353, 6961, 100009]
y7_hs = [19, 245, 2495, 24994]
y7_hm = [200, 1008, 9112, 90112]

y8_ht = [0, 0, 0.01562, 0.160272]
y8_hc = [12, 480, 7660, 110039]
y8_hs = [18, 219, 1991, 19975]
y8_hm = [200, 1008, 9112, 90112]

y9_wt = [0, 0, 0.009953, 0.179929]
y9_wc = [19, 552, 9288, 133983]
y9_ws = [24, 611, 9861, 139685]
y9_wm = [200, 1008, 9112, 90112]

y10_pt = [0, 0, 0, 0.005014]
y10_pc = [9, 99, 999, 9999]
y10_ps = [3, 3, 3, 3]
y10_pm = [200, 1008, 9112, 90112]



#6 ТРИКУТНІ ДАНІ
y1_lt = [0, 0, 0.05968, 3.929773]
y1_lc = [24, 1024, 85163, 6012547]
y1_ls = [17, 534, 77628, 5902270]
y1_lm = [144, 864, 8064, 80064]

y2_lt = [0, 0, 0.009916, 0.09372]
y2_lc = [23, 683, 10533, 149089]
y2_ls = [19, 554, 6588, 84446]
y2_lm = [144, 864, 8064, 80064]

y3_lt = [0, 0, 0.055316, 3.949963]
y3_lc = [22, 945, 84648, 6024585]
y3_ls = [17, 514, 78108, 5924476]
y3_lm = [144, 864, 8064, 80064]

y4_lt = [0, 0.005012, 0.015165, 0.149994]
y4_lc = [19, 573, 9428, 134935]
y4_ls = [19, 386, 6484, 78644]
y4_lm = [144, 864, 8064, 80064]

y5_ht = [0, 0, 0.07812, 7.334743]
y5_hc = [19, 2376, 247712, 24533742]
y5_hs = [18, 240, 2495, 26043]
y5_hm = [144, 864, 8064, 80064]

y6_ht = [0, 0, 0.01562, 1.08376]
y6_hc = [18, 992, 47764, 2224206]
y6_hs = [20, 274, 3556, 41865]
y6_hm = [144, 864, 8064, 80064]

y7_ht = [0, 0, 0.078101, 7.689871]
y7_hc = [13, 2293, 245428, 22295585]
y7_hs = [21, 249, 2529, 30040]
y7_hm = [144, 864, 8064, 80064]

y8_ht = [0, 0, 0.031223, 1.260031]
y8_hc = [18, 1336, 84182, 3668920]
y8_hs = [19, 263, 3311, 41869]
y8_hm = [144, 864, 8064, 80064]

y9_wt = [0, 0, 0.010104, 0.159712]
y9_wc = [17, 472, 8660, 132814]
y9_ws = [17, 472, 8660, 132814]
y9_wm = [144, 864, 8064, 80064]

y10_pt = [0, 0, 0.012167, 0.785012]
y10_pc = [15, 608, 23328, 1048598]
y10_ps = [21, 624, 23392, 1048898]
y10_pm = [144, 864, 8064, 80064]



plt.plot(x, y1_lt, color='red', label='Схема Ломуто + опорний елемент як останній елемент')
plt.plot(x, y2_lt, color='orange', label='Схема Ломуто + опорний елемент як випадковий елемент')
plt.plot(x, y3_lt, color='yellow', label='Схема Ломуто + опорний елемент як медіана трьох елементів')
plt.plot(x, y4_lt, color='green', label='Схема Ломуто + опорний елемент як медіана трьох випадкових')
plt.plot(x, y5_ht, color='blue', label='Схема Гоара + опорний елемент як останній елемент')
plt.plot(x, y6_ht, color='purple', label='Схема Гоара + опорний елемент як випадковий елемент')
plt.plot(x, y7_ht, color='pink', label='Схема Гоара + опорний елемент як медіана трьох елементів')
plt.plot(x, y8_ht, color='gray', label='Схема Гоара + опорний елемент як медіана трьох випадкових')
plt.plot(x, y9_wt, color='brown', label='3-стороннє розбиття')
plt.plot(x, y10_pt, color='black', label='Два опорних елемента')
plt.title("Час сортування даних швидким сортуванням")
plt.xlabel('Довжина вхідних даних')
plt.ylabel("Час виконання")
plt.legend()
plt.show()

plt.plot(x, y1_lc, color='red', label='Схема Ломуто + опорний елемент як останній елемент')
plt.plot(x, y2_lc, color='orange', label='Схема Ломуто + опорний елемент як випадковий елемент')
plt.plot(x, y3_lc, color='yellow', label='Схема Ломуто + опорний елемент як медіана трьох елементів')
plt.plot(x, y4_lc, color='green', label='Схема Ломуто + опорний елемент як медіана трьох випадкових')
plt.plot(x, y5_hc, color='blue', label='Схема Гоара + опорний елемент як останній елемент')
plt.plot(x, y6_hc, color='purple', label='Схема Гоара + опорний елемент як випадковий елемент')
plt.plot(x, y7_hc, color='pink', label='Схема Гоара + опорний елемент як медіана трьох елементів')
plt.plot(x, y8_hc, color='gray', label='Схема Гоара + опорний елемент як медіана трьох випадкових')
plt.plot(x, y9_wc, color='brown', label='3-стороннє розбиття')
plt.plot(x, y10_pc, color='black', label='Два опорних елемента')
plt.title("Кількість порівнянь при сортуванні даних швидким сортуванням")
plt.xlabel('Довжина вхідних даних')
plt.ylabel("Кількість порівнянь")
plt.legend()
plt.show()

plt.plot(x, y1_ls, color='red', label='Схема Ломуто + опорний елемент як останній елемент')
plt.plot(x, y2_ls, color='orange', label='Схема Ломуто + опорний елемент як випадковий елемент')
plt.plot(x, y3_ls, color='yellow', label='Схема Ломуто + опорний елемент як медіана трьох елементів')
plt.plot(x, y4_ls, color='green', label='Схема Ломуто + опорний елемент як медіана трьох випадкових')
plt.plot(x, y5_hs, color='blue', label='Схема Гоара + опорний елемент як останній елемент')
plt.plot(x, y6_hs, color='purple', label='Схема Гоара + опорний елемент як випадковий елемент')
plt.plot(x, y7_hs, color='pink', label='Схема Гоара + опорний елемент як медіана трьох елементів')
plt.plot(x, y8_hs, color='gray', label='Схема Гоара + опорний елемент як медіана трьох випадкових')
plt.plot(x, y9_ws, color='brown', label='3-стороннє розбиття')
plt.plot(x, y10_ps, color='black', label='Два опорних елемента')
plt.title("Кількість переставлянь при сортуванні даних швидким сортуванням")
plt.xlabel('Довжина вхідних даних')
plt.ylabel("Кількість переставлянь")
plt.legend()
plt.show()

plt.plot(x, y1_lm, color='red', label='Схема Ломуто + опорний елемент як останній елемент')
plt.plot(x, y2_lm, color='orange', label='Схема Ломуто + опорний елемент як випадковий елемент')
plt.plot(x, y3_lm, color='yellow', label='Схема Ломуто + опорний елемент як медіана трьох елементів')
plt.plot(x, y4_lm, color='green', label='Схема Ломуто + опорний елемент як медіана трьох випадкових')
plt.plot(x, y5_hm, color='blue', label='Схема Гоара + опорний елемент як останній елемент')
plt.plot(x, y6_hm, color='purple', label='Схема Гоара + опорний елемент як випадковий елемент')
plt.plot(x, y7_hm, color='pink', label='Схема Гоара + опорний елемент як медіана трьох елементів')
plt.plot(x, y8_hm, color='gray', label='Схема Гоара + опорний елемент як медіана трьох випадкових')
plt.plot(x, y9_wm, color='brown', label='3-стороннє розбиття')
plt.plot(x, y10_pm, color='black', label='Два опорних елемента')
plt.title("Кількість використаної пам'яті при сортуванні даних швидким сортуванням")
plt.xlabel('Довжина вхідних даних')
plt.ylabel("Кількість пам'яті")
plt.legend()
plt.show()




X = [1000, 10000, 100000, 1000000] #3, 4

#3 ВИПАДКОВІ ДАНІ
y1_lt = [0.015622, 0.078098, 1.170052, 17.120106]
y1_lc = [11032, 152777, 1998905, 26670059]
y1_ls = [7348, 90210, 1148398, 17592740]
y1_lm = [9024, 87624, 824464, 8697464]

y2_lt = [0, 0.093718, 1.380014, 19.415619]
y2_lc = [10806, 149922, 2063827, 26773545]
y2_ls = [6062, 88605, 1199149, 18531963]
y2_lm = [9024, 87624, 824464, 8697464]

y3_lt = [0.015619, 0.078098, 1.129972, 16.916421]
y3_lc = [10012, 145287, 1879061, 25732735]
y3_ls = [6598, 88710, 1077481, 17214533]
y3_lm = [9024, 87624, 824464, 8697464]

y4_lt = [0.015621, 0.140577, 1.769801, 26.241542]
y4_lc = [9204, 130841, 1734470, 23310069]
y4_ls = [6368, 83204, 1032877, 15699914]
y4_lm = [9024, 87624, 824464, 8697464]

y5_ht = [0.007, 0.080001, 0.938014, 12.55898]
y5_hc = [10188, 114568, 1371577, 14611087]
y5_hs = [3233, 40754, 502683, 6409682]
y5_hm = [9024, 87624, 824464, 8697464]

y6_ht = [0.009001, 0.108006, 1.219976, 15.014966]
y6_hc = [7609, 106134, 1270336, 14662716]
y6_hs = [3410, 42334, 514463, 6419658]
y6_hm = [9024, 87624, 824464, 8697464]

y7_ht = [0.007, 0.085907, 1.111997, 13.39797]
y7_hc = [7782, 103981, 1431276, 14289282]
y7_hs = [3493, 42806, 516265, 6467194]
y7_hm = [9024, 87624, 824464, 8697464]

y8_ht = [0.017999, 0.186987, 2.088029, 24.186946]
y8_hc = [7452, 102126, 1298190, 16416695]
y8_hs = [3308, 41225, 508782, 6405862]
y8_hm = [9024, 87624, 824464, 8697464]

y9_wt = [0.015, 0.189996, 2.42197, 23.794323]
y9_wc = [9507, 134037, 1739541, 20282522]
y9_ws = [10079, 139704, 1790084, 20346988]
y9_wm = [9024, 87624, 824464, 8697464]

y10_pt = [0.00298, 0.024998, 0.24702, 3.001014]
y10_pc = [3147, 32897, 323956, 3661343]
y10_ps = [2390, 23723, 226776, 2664764]
y10_pm = [9024, 87624, 824464, 8697464]



#4 МАЙЖЕ ВІДСОРТОВАНІ ДАНІ
y1_lt = [0.015618, 0.187438, 1.820034, 23.236537]
y1_lc = [29615, 383428, 3620078, 47250753]
y1_ls = [18720, 186397, 1957500, 21625305]
y1_lm = [9112, 90112, 900112, 9000112]

y2_lt = [0.015619, 0.109351, 1.245154, 14.76088]
y2_lc = [11521, 162722, 1964564, 24847585]
y2_ls = [7340, 107359, 1061935, 14308918]
y2_lm = [9112, 90112, 900112, 9000112]

y3_lt = [0, 0.156201, 1.97518, 20.290334]
y3_lc = [21642, 455406, 5434430, 56859774]
y3_ls = [4402, 59745, 865602, 10180234]
y3_lm = [9112, 90112, 900112, 9000112]

y4_lt = [0.01564, 0.140602, 1.579941, 17.478741]
y4_lc = [9117, 129140, 1715844, 21138147]
y4_ls = [5765, 78433, 944146, 11739385]
y4_lm = [9112, 90112, 900112, 9000112]

y5_ht = [0.003999, 0.059019, 0.686036, 8.234981]
y5_hc = [8564, 120907, 1509068, 18658334]
y5_hs = [1339, 14803, 162813, 1775649]
y5_hm = [9112, 90112, 900112, 9000112]

y6_ht = [0.007001, 0.088257, 0.984998, 11.32]
y6_hc = [8027, 111913, 1446055, 17773364]
y6_hs = [1930, 20687, 221918, 2374462]
y6_hm = [9112, 90112, 900112, 9000112]

y7_ht = [0.006999, 0.07004, 0.84798, 10.529976]
y7_hc = [8246, 106755, 1398968, 17029113]
y7_hs = [2250, 24075, 255648, 2706239]
y7_hm = [9112, 90112, 900112, 9000112]

y8_ht = [0.015999, 0.171999, 1.830982, 19.538956]
y8_hc = [8420, 115926, 1510397, 17778850]
y8_hs = [1828, 19922, 214241, 2297114]
y8_hm = [9112, 90112, 900112, 9000112]

y9_wt = [0.015002, 0.181978, 2.214974, 25.026943]
y9_wc = [9160, 133027, 1720317, 20830410]
y9_ws = [9735, 138764, 1777462, 21402007]
y9_wm = [9112, 90112, 900112, 9000112]

y10_pt = [0, 0.005001, 0.788019, 3.748013]
y10_pc = [998, 9998, 1009605, 4867437]
y10_ps = [2, 2, 937725, 3951270]
y10_pm = [9112, 90112, 900112, 9000112]



plt.plot(X, y1_lt, color='red', label='Схема Ломуто + опорний елемент як останній елемент')
plt.plot(X, y2_lt, color='orange', label='Схема Ломуто + опорний елемент як випадковий елемент')
plt.plot(X, y3_lt, color='yellow', label='Схема Ломуто + опорний елемент як медіана трьох елементів')
plt.plot(X, y4_lt, color='green', label='Схема Ломуто + опорний елемент як медіана трьох випадкових')
plt.plot(X, y5_ht, color='blue', label='Схема Гоара + опорний елемент як останній елемент')
plt.plot(X, y6_ht, color='purple', label='Схема Гоара + опорний елемент як випадковий елемент')
plt.plot(X, y7_ht, color='pink', label='Схема Гоара + опорний елемент як медіана трьох елементів')
plt.plot(X, y8_ht, color='gray', label='Схема Гоара + опорний елемент як медіана трьох випадкових')
plt.plot(X, y9_wt, color='brown', label='3-стороннє розбиття')
plt.plot(X, y10_pt, color='black', label='Два опорних елемента')
plt.title("Час сортування даних швидким сортуванням")
plt.xlabel('Довжина вхідних даних')
plt.ylabel("Час виконання")
plt.legend()
plt.show()

plt.plot(X, y1_lc, color='red', label='Схема Ломуто + опорний елемент як останній елемент')
plt.plot(X, y2_lc, color='orange', label='Схема Ломуто + опорний елемент як випадковий елемент')
plt.plot(X, y3_lc, color='yellow', label='Схема Ломуто + опорний елемент як медіана трьох елементів')
plt.plot(X, y4_lc, color='green', label='Схема Ломуто + опорний елемент як медіана трьох випадкових')
plt.plot(X, y5_hc, color='blue', label='Схема Гоара + опорний елемент як останній елемент')
plt.plot(X, y6_hc, color='purple', label='Схема Гоара + опорний елемент як випадковий елемент')
plt.plot(X, y7_hc, color='pink', label='Схема Гоара + опорний елемент як медіана трьох елементів')
plt.plot(X, y8_hc, color='gray', label='Схема Гоара + опорний елемент як медіана трьох випадкових')
plt.plot(X, y9_wc, color='brown', label='3-стороннє розбиття')
plt.plot(X, y10_pc, color='black', label='Два опорних елемента')
plt.title("Кількість порівнянь при сортуванні даних швидким сортуванням")
plt.xlabel('Довжина вхідних даних')
plt.ylabel("Кількість порівнянь")
plt.legend()
plt.show()

plt.plot(X, y1_ls, color='red', label='Схема Ломуто + опорний елемент як останній елемент')
plt.plot(X, y2_ls, color='orange', label='Схема Ломуто + опорний елемент як випадковий елемент')
plt.plot(X, y3_ls, color='yellow', label='Схема Ломуто + опорний елемент як медіана трьох елементів')
plt.plot(X, y4_ls, color='green', label='Схема Ломуто + опорний елемент як медіана трьох випадкових')
plt.plot(X, y5_hs, color='blue', label='Схема Гоара + опорний елемент як останній елемент')
plt.plot(X, y6_hs, color='purple', label='Схема Гоара + опорний елемент як випадковий елемент')
plt.plot(X, y7_hs, color='pink', label='Схема Гоара + опорний елемент як медіана трьох елементів')
plt.plot(X, y8_hs, color='gray', label='Схема Гоара + опорний елемент як медіана трьох випадкових')
plt.plot(X, y9_ws, color='brown', label='3-стороннє розбиття')
plt.plot(X, y10_ps, color='black', label='Два опорних елемента')
plt.title("Кількість переставлянь при сортуванні даних швидким сортуванням")
plt.xlabel('Довжина вхідних даних')
plt.ylabel("Кількість переставлянь")
plt.legend()
plt.show()

plt.plot(X, y1_lm, color='red', label='Схема Ломуто + опорний елемент як останній елемент')
plt.plot(X, y2_lm, color='orange', label='Схема Ломуто + опорний елемент як випадковий елемент')
plt.plot(X, y3_lm, color='yellow', label='Схема Ломуто + опорний елемент як медіана трьох елементів')
plt.plot(X, y4_lm, color='green', label='Схема Ломуто + опорний елемент як медіана трьох випадкових')
plt.plot(X, y5_hm, color='blue', label='Схема Гоара + опорний елемент як останній елемент')
plt.plot(X, y6_hm, color='purple', label='Схема Гоара + опорний елемент як випадковий елемент')
plt.plot(X, y7_hm, color='pink', label='Схема Гоара + опорний елемент як медіана трьох елементів')
plt.plot(X, y8_hm, color='gray', label='Схема Гоара + опорний елемент як медіана трьох випадкових')
plt.plot(X, y9_wm, color='brown', label='3-стороннє розбиття')
plt.plot(X, y10_pm, color='black', label='Два опорних елемента')
plt.title("Кількість використаної пам'яті при сортуванні даних швидким сортуванням")
plt.xlabel('Довжина вхідних даних')
plt.ylabel("Кількість пам'яті")
plt.legend()
plt.show()